app/Http/Controllers/CartController.php

select * from `products` where `id` = '2' limit 1
---
    public function show($id)
    {
//      $product = DB::table('products')->where('id', $id)->first();
        $product = Product::select('*')->where('id',$id)->first();