app/Http/Controllers/ProductController.php

select * from `products`
---
    public function show()
    {
        //$products = Product::orderBy('name')->get();
        //$products = Product::orderBy('price','asc')->get();
        $products = Product::all();

select * from `products` where `id` = '2' limit 1
---
    public function detail($id)
    {
        //$product = DB::table('products')->where('id', $id)->first();
        $product = Product::find($id);